package org.telegram.data;

public class BotMessageText {
    public final static String FIRST_START_TEXT = "Привіт! \nДля початку вводу особового рахунку натисніть Старт або оберіть необхідний розділ";
    public final static String START_TEXT = "Для передачі показів електролічильника введіть, будь ласка, номер Вашого Особового рахунку. (Номер Особового рахунку складається з 9-ти цифр, перша з яких двійка: 2ХХХХХХХХ, або четвірка: 4ХХХХХХХХ)";
    public final static String START_TEXT_LEVEL_1_1 = "Ваш номер OP ";
    public final static String START_TEXT_LEVEL_1_2 = ". Вкажіть тип лічильника (Внизу екрана: /Звичайний, /Двозонний, /Тризонний).\n\nЯкщо OP потребує змін - Натисніть Змінити ОР";

    public final static String START_TEXT_LEVEL_2_1 = "Ви обрали лічильник "; //Type
    public final static String START_TEXT_LEVEL_2_2  =  "\nВведіть показ\n" + "(Всі цифри до коми. Максимум сім цифр)";
    public final static String START_TEXT_LEVEL_2_2_1  =  "\nВведіть покази:\n НІЧ пробіл ДЕНЬ \n" + "(Всі цифри до коми. Максимум сім цифр)";
    public final static String START_TEXT_LEVEL_2_3  =  "\nВведіть покази:\n ПІК пробіл НАПІВПІК пробіл НІЧ \n" + "(Всі цифри до коми. Максимум сім цифр)";

    public final static String START_TEXT_LEVEL_3_1 = "Ваші покази на "; //data
    public final static String START_TEXT_LEVEL_3_3 = "\nНомер рахунку: "; //OP
    public final static String START_TEXT_LEVEL_3_4 = "\nТип лічильника: "; //Type
    public final static String START_TEXT_LEVEL_3_5 = "\nПокази лічильника: " ; //int
    public final static String START_TEXT_LEVEL_3_6 = "\n\nЯкщо правильно, то натисніть кнопку \"Відправити\"";

    public final static String SENTED = "Ваші покази прийнято до опрацювання. Пам’ятайте: покази мають бути фактичними на дату передачі та будуть перевірятись на достовірність перед завантаженням до системи розрахунків Товариства. \n \nБот надішле результат перевірки через деякий час. \n \n Дякуємо за співпрацю! \n Якщо ви бажаєте передати покази по іншому Особовому рахунку - натисніть кнопку /Старт";


    public final static String HELP_TEXT = "Чат-бот від Прикарпаттяобленерго працює для передачі показів електролічильників споживачами. Дана функція працює у будь-який момент користування чат-ботом.\n" +
            "Для повідомлення боту показів вашого лічильника, потрібно зробити три кроки\n" +
            "1. Натиснути кнопку \"Старт\" та ввести ваш номер особового рахунку (складається з 9-ти цифр, перша з яких двійка: 2ХХХХХХХХ, або четвірка: 4ХХХХХХХХ).\n" +
            "2. Обрати тип лічильника: Звичайний, Двозонний (день/ніч) або Тризонний ( пік, напівпік, ніч)\n" +
            "3. Повідомити покази лічильника (На дисплеї лічильника всі цифри до коми. Максимум сім цифр).\nПокази будуть прийняті на дату повідомлення. Проте покази 1-го числа будуть прийняті до розрахунку останньою датою попереднього розрахункового періоду.\n" +
            "Пам’ятайте: покази мають бути фактичними на дату передачі та будуть перевірятись на достовірність перед завантаженням до системи розрахунків Товариства.\n Бот надішле результат перевірки через деякий час.\n \nЯкщо у вас виникли інші запитання щодо роботи АТ «Прикарпаттяобленерго», будь ласка, зверніться до нашого Колл-центру: 0 800 50 40 20, або на електронну пошту: kanc@oe.if.ua\n Більше інформації щодо приєднання електроустановок до мереж, тарифів за електроенергію на нашому сайті: https://oe.if.ua/uk";

    public final static String ACC_INPUT_ERROR_MASSGE_1_1 = "Невірний формат.\n \n(Номер Особового рахунку складається з 9-ти цифр, перша з яких двійка: 2ХХХХХХХХ, або четвірка: 4ХХХХХХХХ).\n \nЯкщо Ви хочете почати спочатку, то натисніть  /Старт або /Допомога для отримання допомоги.";
    public final static String TYPE_INPUT_ERROR_MASSGE_2_1 = "\nНе вірний формат лічильника \n";
    public final static String TYPE_INPUT_ERROR_MASSGE_3_1 = "Невірний формат. Введіть покази відповідно лічильника, який Ви обрали: ";
    public final static String TYPE_INPUT_ERROR_MASSGE_3_2_1 = "Звичайний (Всі цифри. Максимум сім цифр) або змініть тип лічильника \n \nЯкщо ви хочете почати спочатку то натисніть кнопку /Старт або натисніть кнопку /Допомога для отримання допомоги.";
    public final static String TYPE_INPUT_ERROR_MASSGE_3_2_2 = "Двозонний - НІЧ пробіл ДЕНЬ (Всі цифри. Максимум сім цифр) або змініть тип лічильника \n \n Якщо ви хочете почати спочатку то натисніть кнопку /Старт або натисніть кнопку /Допомога для отримання допомоги.";
    public final static String TYPE_INPUT_ERROR_MASSGE_3_2_3 = "Тризонний - ПІК пробіл НАПІВПІК пробіл НІЧ (Всі цифри. Максимум сім цифр) або змініть тип лічильника \n \nЯкщо ви хочете почати спочатку то натисніть кнопку /Старт або натисніть кнопку /Допомога для отримання допомоги.";

    public final static String ERROR_MASSGE_INFO = "Оберіть будь-ласка необхідний розділ.";

    public static final String PEAK  = "ПІК: ";
    public static final String SEMI_PEAK  = "НАПІВПІК: ";
    public static final String NIGHT = "НІЧ: ";
    public static final String DAY = "ДЕНЬ: ";

    public static final String CHAT_START = "Зачекайте будь-ласка, вільний оператор зараз з'єднається з Вами";
    public static final String CHAT_ANY_THING = "Олексію, мені нікуди відправляти повідомлення, дай ресурс!";
}
